tutorials/eulerVortex.twitch.unstructured/eulerVortex.cyclic.twitch/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
24166
(
(0.894786 0.445962 0)
(0.89424 0.447241 0)
(0.8944 0.4472 0)
(0.8944 0.4472 0)
(0.8944 0.4472 0)
(0.8944 0.4472 0)
(0.8944 0.4472 0)
(0.8944 0.4472 0)
...
)
;

boundaryField
{
    emptyPatches_empt
    {
        type            empty;
    }
    top_cyc
    {
        type            cyclic;
    }
    bottom_cyc
    {
        type            cyclic;
    }
    inlet_cyc
    {
        type            cyclic;
    }
    outlet_cyc
    {
        type            cyclic;
    }
}


// ************************************************************************* //
